app/controllers/books_controller.rb

  def list
    @customer = Customer.where(["id = ?", params[:customer_id]]).first
    @customer_books = CustomerBook.where(["customer_id = ?", params[:customer_id]])
---
SELECT "books".* FROM "books" WHERE "books"."id" = 3 LIMIT 1
SELECT "customer_books".* FROM "customer_books" WHERE (customer_id = '2')

  def returned
    @customer = Customer.where(["id = ?", params[:customer_id]]).first
    book = CustomerBook.where(["bookable_id = ? and customer_id = ?", params[:id], params[:customer_id]]).first
    book.status = 'returned'

    if book.save
---
SELECT "customer_books".* FROM "customer_books" WHERE (book_id = '2' and customer_id = '2') LIMIT 1
UPDATE "customer_books" SET "status" = 'returned', "updated_at" = '2018-09-10 03:18:48.845313' WHERE "customer_books"."id" = 2