app/controllers/users_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
SELECT "customer_books".* FROM "customer_books" WHERE (customer_id = '2')
---
  def show
    @customer = Customer.where(["id = ?", params[:id]]).first
    @customer_books = CustomerBook.where(["customer_id = ?", params[:id]])